; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v8 - type_3 ?v4 - type_1)
 	      (pred_1 ?v6 - object ?v4 - type_1)
	      (pred_2 ?v8 - type_3 ?v1 - type_2)
	      (pred_4 ?v8 - type_3 ?v6 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v8 - type_3 ?v5 ?v3 - type_1)
       :precondition (and  (pred_3 ?v8 ?v5))
       :effect (and  (pred_3 ?v8 ?v3)
		     (not (pred_3 ?v8 ?v5))))

   (:action op_1
       :parameters (?v8 - type_3 ?v2 - object ?v7 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v7) (pred_3 ?v8 ?v7) (pred_2 ?v8 ?v1))
       :effect (and (pred_4 ?v8 ?v2 ?v1)
		    (not (pred_1 ?v2 ?v7)) 
		    (not (pred_2 ?v8 ?v1))))

   (:action op_3
       :parameters (?v8 - type_3 ?v2 - object ?v7 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v2 ?v1) (pred_3 ?v8 ?v7))
       :effect (and (pred_1 ?v2 ?v7)
		    (pred_2 ?v8 ?v1)
		    (not (pred_4 ?v8 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_11 - type_3
obj_01 obj_10 obj_08 obj_14 - type_2
obj_09 obj_04 obj_05 obj_06 - type_1
obj_03 obj_13 obj_02 obj_07 - object)
(:init
(pred_3 obj_12 obj_05)
(pred_2 obj_12 obj_01)
(pred_2 obj_12 obj_10)
(pred_3 obj_11 obj_09)
(pred_2 obj_11 obj_08)
(pred_2 obj_11 obj_14)
(pred_1 obj_03 obj_04)
(pred_1 obj_13 obj_09)
(pred_1 obj_02 obj_04)
(pred_1 obj_07 obj_06)
)
(:goal
(and
(pred_1 obj_03 obj_05)
(pred_1 obj_13 obj_05)
(pred_1 obj_02 obj_06)
(pred_1 obj_07 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_12 obj_06)))
)
)

; plan
1. (op_1 obj_11 obj_13 obj_09 obj_14)
   deleted: (pred_1 obj_13 obj_09) (pred_2 obj_11 obj_14)
   added: (pred_4 obj_11 obj_13 obj_14)
   goals met: 0 of 4
2. (op_2 obj_12 obj_05 obj_04)
   deleted: (pred_3 obj_12 obj_05)
   added: (pred_3 obj_12 obj_04)
   goals met: 0 of 4
3. (op_2 obj_11 obj_09 obj_05)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_05)
   goals met: 0 of 4
4. (op_1 obj_12 obj_02 obj_04 obj_10)
   deleted: (pred_1 obj_02 obj_04) (pred_2 obj_12 obj_10)
   added: (pred_4 obj_12 obj_02 obj_10)
   goals met: 0 of 4
5. (op_3 obj_11 obj_13 obj_05 obj_14)
   deleted: (pred_4 obj_11 obj_13 obj_14)
   added: (pred_1 obj_13 obj_05) (pred_2 obj_11 obj_14)
   goals met: 1 of 4
6. (op_3 obj_12 obj_02 obj_04 obj_10)
   deleted: (pred_4 obj_12 obj_02 obj_10)
   added: (pred_1 obj_02 obj_04) (pred_2 obj_12 obj_10)
   goals met: 1 of 4
7. (op_2 obj_11 obj_05 obj_04)
   deleted: (pred_3 obj_11 obj_05)
   added: (pred_3 obj_11 obj_04)
   goals met: 1 of 4
8. (op_1 obj_11 obj_03 obj_04 obj_14)
   deleted: (pred_1 obj_03 obj_04) (pred_2 obj_11 obj_14)
   added: (pred_4 obj_11 obj_03 obj_14)
   goals met: 1 of 4
9. (op_2 obj_11 obj_04 obj_05)
   deleted: (pred_3 obj_11 obj_04)
   added: (pred_3 obj_11 obj_05)
   goals met: 1 of 4
10. (op_3 obj_11 obj_03 obj_05 obj_14)
   deleted: (pred_4 obj_11 obj_03 obj_14)
   added: (pred_1 obj_03 obj_05) (pred_2 obj_11 obj_14)
   goals met: 2 of 4
11. (op_2 obj_11 obj_05 obj_06)
   deleted: (pred_3 obj_11 obj_05)
   added: (pred_3 obj_11 obj_06)
   goals met: 2 of 4
12. (op_1 obj_11 obj_07 obj_06 obj_14)
   deleted: (pred_1 obj_07 obj_06) (pred_2 obj_11 obj_14)
   added: (pred_4 obj_11 obj_07 obj_14)
   goals met: 2 of 4
13. (op_2 obj_11 obj_06 obj_04)
   deleted: (pred_3 obj_11 obj_06)
   added: (pred_3 obj_11 obj_04)
   goals met: 2 of 4
14. (op_3 obj_11 obj_07 obj_04 obj_14)
   deleted: (pred_4 obj_11 obj_07 obj_14)
   added: (pred_1 obj_07 obj_04) (pred_2 obj_11 obj_14)
   goals met: 3 of 4
15. (op_1 obj_11 obj_02 obj_04 obj_14)
   deleted: (pred_1 obj_02 obj_04) (pred_2 obj_11 obj_14)
   added: (pred_4 obj_11 obj_02 obj_14)
   goals met: 3 of 4
16. (op_2 obj_11 obj_04 obj_06)
   deleted: (pred_3 obj_11 obj_04)
   added: (pred_3 obj_11 obj_06)
   goals met: 3 of 4
17. (op_3 obj_11 obj_02 obj_06 obj_14)
   deleted: (pred_4 obj_11 obj_02 obj_14)
   added: (pred_1 obj_02 obj_06) (pred_2 obj_11 obj_14)
   goals met: 4 of 4
